<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>analyses the log for task dispatching issues. Will install the app and readme file in a folder named DispatchView.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.DispatchView</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Admin Utils</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>DispatchView shows log entries for two key systems DAS and CTS whose failure can result in Time Machine backups becoming irregular or stopping altogether, and may be involved in apps or services stalling or behaving unreliably. It can save you lots of effort using Consolation. Future versions will automatically analyse the health of DAS/CTS too.</string>
			<key>developer</key>
			<string>The Eclectic Company</string>
			<key>display_name</key>
			<string>DispatchView</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
            <array>
                <string>DispatchView</string>
            </array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.pkg.DispatchView</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
