<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>OnlyOffice Suite for Munki.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.OnlyOffice-Silicon</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm</string>	    
		<key>MUNKI_CATEGORY</key>
		<string>Bureautique</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>office</string>
		<key>pkginfo</key>
		<dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>OnlyOffice is an alternative to Office.</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>ONLYOFFICE</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.pkg.ONLYOFFICE</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>source_path</key>
			    <string>%pkg_path%</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/%NAME%_%ARCH%_%version%.pkg</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%ARCH%_%version%.pkg</string>
				<key>additional_makepkginfo_options</key>
				<array>
				    <string>--displayname=%NAME%-Silicon</string>				
				    <string>--minimum-os-version=10.12.0</string>
				    <string>--arch=arm64</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
