<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads latest LibreOffice and the language pack of the specified language.</string>
	<key>Identifier</key>
	<string>Localized-LibreOffice.download.recipe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>LANGUAGE_CODE</key>
		<string>fr</string>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
			    <string>http://download.documentfoundation.org/libreoffice/stable/%version%/mac/x86_64/LibreOffice_%version%_MacOS_x86-64_langpack_%LANGUAGE_CODE%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>source_path</key>
			    <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice_%version%_MacOS_x86-64.dmg/%NAME%.app</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>source_path</key>
			    <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice_%version%_MacOS_x86-64_langpack_%LANGUAGE_CODE%.dmg/LibreOffice Language Pack.app</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-LanguagePack.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%INSTALL_DIR%/%NAME%.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-LanguagePack.app/Contents/tarball.tar.bz2</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%INSTALL_DIR%/%NAME%.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
