<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>lists full system and security update installation history</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.SystHist</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Admin Utils</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>INSTALL_DIR</key>
		<string>Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>SystHist is a clean and simple app which tells you all the OS X/macOS system and security updates which have been installed on that Mac. Now probes deep into protected territory to find even silent silent updates, and gives details of all the files updated. Full release includes extensive Help book.</string>
			<key>developer</key>
			<string>The Eclectic Company</string>
			<key>display_name</key>
			<string>SystHist</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
            <array>
                <string>SystHist</string>
            </array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.SystHist</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>force_munkiimport</key>
				<false/>
				<key>additional_makepkginfo_options</key>
				<array>
				    <string>--destinationpath=%INSTALL_DIR%</string>
				    <string>-o root</string>
				    <string>-g admin</string>
				    <string>-m ug+rwx,o+rx</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
