<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Package KeychainCheck. Will install the app and the "readme" in a folder named KeychainCheck.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.pkg.KeychainCheck</string>
	<key>Input</key>
	<dict>
		<key>INSTALL_DIR</key>
		<string>Applications</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.KeychainCheck</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>Copier</string>
		    <key>Arguments</key>
		    <dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>destination_path</key>
				<string>%pkgroot%/%INSTALL_DIR%/%NAME%</string>
		    </dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>FileCreator</string>
		    <key>Arguments</key>
		    <dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfoTemplate</string>
				<key>file_content</key>
				<string>&lt;?xml version="1.0" encoding="utf-8" standalone="no"?&gt;
&lt;pkg-info overwrite-permissions="false" followSymLinks="true"/&gt;
</string>
		    </dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>PkgInfoCreator</string>
		    <key>Arguments</key>
		    <dict>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>version</key>
				<string>%version%</string>
				<key>template_path</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfoTemplate</string>
		    </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>infofile</key>
					<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
					<dict>
						<key>path</key>
						<string>/</string>
						<key>user</key>
						<string>root</string>
						<key>group</key>
						<string>admin</string>
						<key>mode</key>
						<string>0775</string>
					</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>

