<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of pCloudDrive.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.pCloudDrive-M1</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>pCloudDrive</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;appversion&gt;[0-9]+\.[0-9]+\.[0-9]+).*href=\"(https://[^=]+)?(?P&lt;dlurl&gt;[^\"]+)</string>
				<key>url</key>
				<string>https://www.pcloud.com/fr/release-notes/mac-os.html</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>with\ the\ M1\ chip.*href=\"(https://[^=]+)?(?P&lt;dlurlm1&gt;[^\"]+)</string>
				<key>url</key>
				<string>https://www.pcloud.com/fr/release-notes/mac-os.html</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>downloadlink\"\:\ \"[^/]+/[^/]/(?P&lt;urldomain&gt;[^/]+)[^/]/(?P&lt;urlpart&gt;[^/]+)[^/]/(?P&lt;urlfile&gt;[^\"]+)</string>
				<key>url</key>
				<string>https://u.pcloud.link/publink/show?code=%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_%appversion%-M1.pkg</string>
				<key>url</key>
				<string>https://%urldomain%/%urlpart%/%urlfile%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
