<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recreate the pCloudDrive pkg to have the app version as pkg version.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.pkg.pCloudDrive</string>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.pCloudDrive</string>
	<key>Input</key>
    <dict>
    </dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pCloud-Pkg/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/pCloud-Pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pCloud-App/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>

		<dict>
		    <key>Processor</key>
		    <string>FileCreator</string>
		    <key>Arguments</key>
		    <dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfoTemplate</string>
				<key>file_content</key>
				<string>&lt;?xml version="1.0" encoding="utf-8" standalone="no"?&gt;
&lt;pkg-info overwrite-permissions="false" followSymLinks="true"/&gt;
</string>
		    </dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>PkgInfoCreator</string>
		    <key>Arguments</key>
		    <dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pCloud-App</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>version</key>
				<string>%appversion%</string>
				<key>template_path</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfoTemplate</string>
		    </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%appversion%</string>
					<key>version</key>
					<string>%appversion%</string>
					<key>id</key>
					<string>com.mobileinno.pkg.pCloudDrive</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
					<dict>
						<key>path</key>
						<string>/</string>
						<key>user</key>
						<string>root</string>
						<key>group</key>
						<string>admin</string>
						<key>mode</key>
						<string>0755</string>
					</dict>
					</array>
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
    				<string>%RECIPE_CACHE_DIR%/pCloud-App/Applications</string>
    			</array>
			</dict>
		</dict>
		
	</array>
</dict>
</plist>
