<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of OpenWebStart from nstrauss repo and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.OpenWebStart</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenWebStart</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.donwload.OpenWebStart</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
