<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Control remotly a desktop</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Anydesk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Anydesk</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://download.anydesk.com/anydesk.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		    <key>Arguments</key>
		    <dict>
			<key>input_path</key>
			<string>%pathname%/AnyDesk.app</string>
			<key>requirement</key>
			<string>identifier "com.philandro.anydesk" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KU6W3B6JMZ</string>
		    </dict>
		    <key>Processor</key>
		    <string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
