<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the download of Waterfox Classic.
	To download the Current branch of the app, use the Waterfox recipes.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.pkg.Waterfox-Classic</string>
	<key>Input</key>
	<dict>
	    <key>APPNAME</key>
	    <string>Waterfox Classic.app</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.Waterfox-Classic</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>AppPkgCreator</string>
	</dict>
	</array>
</dict>
</plist>
