<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Classic branch of Waterfox.
	To download the Current branch of the app, use the Waterfox recipe.
	Waterfox is a fork of Firefox.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Waterfox-Classic</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Waterfox</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\"version\":\"(?P&lt;WFversion&gt;[\d]+\.[\d]+)\.</string>
				<key>url</key>
				<string>https://classic.waterfox.net/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>Waterfox.Classic.%WFversion%.Setup.dmg</string>
				<key>url</key>
				<string>https://github.com/WaterfoxCo/Waterfox-Classic/releases/download/%WFversion%-classic/Waterfox.Classic.%WFversion%.Setup.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>

