<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Classic branch of Waterfox.
	To download the Current branch of the app, use the Waterfox recipe.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Waterfox-Classic</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Waterfox</string>
		<key>APPBRANCH</key>
		<string>Classic</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;WFdmgname&gt;Waterfox\%20%APPBRANCH%[ ]?(?P&lt;WFversion&gt;[^ ]*)[^\.]*\.dmg)</string>
				<key>url</key>
				<string>https://www.waterfox.net/releases/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%APPBRANCH%-%WFversion%.dmg</string>
				<key>url</key>
				<string>https://cdn.waterfox.net/releases/osx64/installer/%WFdmgname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
