<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Alternative to Firefox.
	This recipe install Classic version of Waterfox.
	To download the Current version of the app, use the Waterfox recipe.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.Waterfox-Classic</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Internet Browser</string>
			<key>developer</key>
			<string>Waterfox</string>
			<key>display_name</key>
			<string>Waterfox</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
            <array>
                <string>%APPNAME%</string>
            </array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.pkg.Waterfox-Classic</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
                    <key>preinstall_script</key>
                    <string>#!/bin/zsh

[ -e /Applications/Waterfox\ Classic.app ] &amp;&amp; rm -rf "/Applications/Waterfox\ Classic.app"
[ -e /Applications/Waterfox\ Classic ] &amp;&amp; rm -rf "/Applications/Waterfox\ Classic"
</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
