<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Classic branch of Waterfox.
	To download the Current branch of the app, use the Waterfox recipe.
	Waterfox is a fork of Firefox.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Waterfox-Classic</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Waterfox-Classic</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>WaterfoxCo/Waterfox-Classic</string>
				<key>include_prereleases</key>
				<true/>
				<key>asset_regex</key>
				<string>.+\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Waterfox Classic.app</string>
				<key>requirement</key>
				<string>identifier "org.waterfoxproject.waterfox classic" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2YMCX79ULQ"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
