<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>A command tool to write into the log in macOS Sierra and High Sierra</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Blowhole</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blowhole</string>
		<key>SEARCH_PATTERN</key>
		<string>([0-9]+/[0-9]+/blowhole(?P&lt;version&gt;[0-9]+).*\.zip)</string>
		<key>SEARCH_URL</key>
		<string>https://eclecticlight.co/downloads/</string>
		<key>DL_URL</key>
		<string>https://eclecticlightdotcom.files.wordpress.com/</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%DL_URL%/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistEditor</string>
			<key>Arguments</key>
			<dict>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Version.plist</string>
		    	<key>plist_data</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>%version%.0</string>
                </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
		    	<key>purge_destination</key>
			    <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unzip/blowhole*/Blowhole.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>overwrite</key>
			    <true/>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Blowhole.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
			    <key>path_list</key>
    			<array>
		    		<string>%RECIPE_CACHE_DIR%/unzip</string>
    			</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
