<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of IPSecuritas.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.IPSecuritas</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>IPSecuritas</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(ipsecuritas[\ -]([0-9]+\.[0-9]+(\.[0-9]+)?))\.dmg</string>
				<key>url</key>
				<string>https://lobotomo.com/products/IPSecuritas/index.html</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_%match%.dmg</string>
				<key>url</key>
				<string>https://lobotomo.com/download/%match%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
