<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Client VPN from Lobotomo Software</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.IPSecuritas</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Client VPN</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>

		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.IPSecuritas</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/IPSecuritas.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>full_version</string>
					<key>CFBundleVersion</key>
					<string>version</string>
					<key>CFBundleIdentifier</key>
					<string>bundleID</string>
					<key>CFBundleName</key>
					<string>appname</string>					
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
        			<key>display_name</key>
		        	<string>IPSecuritas %full_version%</string>
        			<key>version</key>
		        	<string>%version%</string>
                    <key>minimum_os_version</key>
                    <string>10.15</string>
         			<key>developer</key>
		        	<string>Lobotomo Software</string>
                    <key>postinstall_script</key>
                    <string>#!/bin/zsh
  
launchctl bootout system /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
#kill -9 $(ps -ax |grep IPSecuritasMenu |grep -v grep|cut -f1 -d\ )

rm -rf /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers
rm -rf /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/admin.sock
rm -rf /Library/PrivilegedHelperTools/com.lobotomo.IPSecuritasDaemon

mkdir -p /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers
chmod 700  /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers
cp -R /Applications/IPSecuritas.app/Contents/Library/helpers/*  /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers/
chmod -R 755  /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers/*
chmod 644  /Library/Application\ Support/Lobotomo\ Software/IPSecuritas/helpers/IPSecuritasFilter.kext/Contents/_CodeSignature

cp /Applications/IPSecuritas.app/Contents/Library/LaunchServices/com.lobotomo.IPSecuritasDaemon /Library/PrivilegedHelperTools
chmod 544 /Library/PrivilegedHelperTools/com.lobotomo.IPSecuritasDaemon

echo "&lt;?xml version="1.0" encoding="UTF-8"?&gt;" &gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "&lt;plist version="1.0"&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "&lt;dict&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;key&gt;KeepAlive&lt;/key&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;true/&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;key&gt;Label&lt;/key&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;string&gt;com.lobotomo.IPSecuritasDaemon&lt;/string&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;key&gt;Program&lt;/key&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;string&gt;/Library/PrivilegedHelperTools/com.lobotomo.IPSecuritasDaemon&lt;/string&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;key&gt;ProgramArguments&lt;/key&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;array&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "          &lt;string&gt;/Library/PrivilegedHelperTools/com.lobotomo.IPSecuritasDaemon&lt;/string&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;/array&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;key&gt;RunAtLoad&lt;/key&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "  &lt;true/&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "&lt;/dict&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
echo "&lt;/plist&gt;" &gt;&gt; /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist

chmod 644 /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist

launchctl bootstrap system /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist
launchctl kickstart system/com.lobotomo.IPSecuritasDaemon

killall IPSecuritasMenu

exit 0

                    </string>
        			<key>blocking_applications</key>
                    <array>
                        <string>IPSecuritas</string>
                        <string>racoon-ipsecuritas</string>
                    </array>
                	<key>postuninstall_script</key>
        	        <string>#!/bin/sh

/bin/launchctl unload /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist

rm -rf /Library/LaunchDaemons/com.lobotomo.IPSecuritasDaemon.plist /Library/PrivilegedHelperTools/com.lobotomo.IPSecuritasDaemon
        	        </string>
        	        <key>installs</key>
					<array>
						<dict>
								<key>CFBundleIdentifier</key>
								<string>%bundleID%</string>
								<key>CFBundleName</key>
								<string>%appname%</string>
								<key>CFBundleShortVersionString</key>
								<string>%full_version%</string>
								<key>CFBundleVersion</key>
								<string>%version%</string>
								<key>path</key>
								<string>/Applications/IPSecuritas.app</string>
								<key>type</key>
								<string>application</string>
								<key>version_comparison_key</key>
								<string>CFBundleVersion</string>
						</dict>
					</array>
					</dict>
			</dict>
		</dict>		


		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>IPSecuritas.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
