<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Alternative to Firefox.
	This recipe install the Current version.
	To download the Classic version of the app, use the Waterfox-Classic recipe.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.download.Waterfox</string>
	<key>Input</key>
	<dict>
	    <key>NAME</key>
	    <string>Waterfox</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>/BrowserWorks/waterfox/tree/(?P&lt;WFVersion&gt;\d+\.\d+\.\d+)[^\-]</string>
				<key>url</key>
				<string>https://github.com/BrowserWorks/Waterfox/releases</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>Waterfox-%WFVersion%.dmg</string>
				<key>url</key>
				<string>https://cdn1.waterfox.net/waterfox/releases/%WFVersion%/Darwin_x86_64-aarch64/Waterfox%20%WFVersion%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>



