<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>a log browser for macOS Sierra and High Sierra. Will install the app and the other files in a folder named Consolation3.</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.Consolation3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Admin Utils</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Consolation provides an accessible but powerful way to browse, search, and analyse entries in the new log system which have already been captured.</string>
			<key>developer</key>
			<string>The Eclectic Company</string>
			<key>display_name</key>
			<string>Consolation 3</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
            <array>
                <string>Consolation3</string>
            </array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.pkg.Consolation3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
